Revit 2026 API

# IndependentTagMultiReferenceAnnotationId Property

---

The multi-reference annotation which owns this tag.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId MultiReferenceAnnotationId { get; }
```
```vb
Public ReadOnly Property MultiReferenceAnnotationId As ElementId
	Get
```
```cpp
public:
property ElementId^ MultiReferenceAnnotationId {
	ElementId^ get ();
}
```
```fsharp
member MultiReferenceAnnotationId : ElementId with get
```

#### Property Value

ElementId

[!:Autodesk::Revit::DB::MultiReferenceAnnotation] for more information.

#### Reference

IndependentTag Class

Autodesk.Revit.DB Namespace